rottenpotatoes/app/controllers/movies_controller.rb

  def same_director
    @movie = Movie.find params[:id]
    @director = @movie.director
    if @director.blank?
      flash[:notice] = "'#{@movie.title}' has no director info"
      return redirect_to movies_path

    end

    @movies = @movie.find_movies_same_director
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]